app/Controllers/Api.php

                        $company["total_treatment"] = count($company["groups"]);

                        $model = new CustomerModel;
                        $company["total_customer"] = $model->where('companyId',$post["company_id"])->get()->getNumRows();

                        $model = new EmpModel;
                        $company["staffs"] = $model->select('id,fname,lname,designation,avatar')->where('user_type',1)->where('is_shown_on_website',1)->where("is_active",'1')->get()->getResultArray();
                        $company["salon_staffs"] = $model->where('user_type',1)->where("is_active",'1')->get()->getNumRows();
---
SELECT *
FROM `customers`
WHERE `companyId` = '1'
SELECT `id`, `fname`, `lname`, `designation`, `avatar`
FROM `staffs`
WHERE `user_type` = 1
AND `is_shown_on_website` = 1
AND `is_active` = '1'
SELECT *
FROM `staffs`
WHERE `user_type` = 1
AND `is_active` = '1'

        public function treatments()
        {
            $post = $this->request->getVar();
            $input_parameter = array('key','tag','company_id');
            $validation = ParamValidation($input_parameter, $post);

            if($validation[RESPONSE_STATUS] == RESPONSE_FLAG_FAIL)
            {
                return $this->respond($validation);
            } else if($post['key'] != APP_KEY || $post['tag'] != "treatments") {
                $response[RESPONSE_STATUS] = RESPONSE_FLAG_FAIL;
                $response[RESPONSE_MESSAGE] = RESPONSE_INVALID_KEY;
                return $this->respond($response);
            } else {
                $ids1 = $service_ids = array();

                $model = new CompanyModel;
                $company = $model->select("company_service_groups,company_services")->where("id",$post["company_id"])->first();
                if($company && !is_null($company["company_service_groups"]) && $company["company_service_groups"] != "") {
                    $ids1 = explode(",",$company["company_service_groups"]);
                }
                if($company && !is_null($company["company_services"]) && $company["company_services"] != "") {
                    $service_ids = explode(",",$company["company_services"]);
                }
                if($ids1) {
                    $model = new ServiceModel;
                    $treatments = $model->select("id,name,slug,avatar")->where(["is_active" => '1','is_deleted' => 0])->whereIn('id',$ids1)->orderBy("position","asc")->get()->getResultArray();
---
SELECT `id`, `name`, `slug`, `avatar`
FROM `service_groups`
WHERE `is_active` = '1'
AND `is_deleted` = 0
AND `id` IN ('1','2','3','4','5','7','8','9','10','12','13','14','37','39','42')
ORDER BY `position` ASC

        public function our_reviews()
        {
            $post = $this->request->getVar();
            $input_parameter = array('key','tag','company_id');
            $validation = ParamValidation($input_parameter, $post);

            if($validation[RESPONSE_STATUS] == RESPONSE_FLAG_FAIL)
            {
                return $this->respond($validation);
            } else if($post['key'] != APP_KEY || $post['tag'] != "our_reviews") {
                $response[RESPONSE_STATUS] = RESPONSE_FLAG_FAIL;
                $response[RESPONSE_MESSAGE] = RESPONSE_INVALID_KEY;
                return $this->respond($response);
            } else {
                $db = db_connect();
                $res = $db->table('reviews r');
                $res = $res->select("r.*,c.name");
                $res = $res->join("customers c","c.id=r.given_by");
                $res = $res->where(["company_id" => $post["company_id"],"is_approved" => 1]);
                $res = $res->where("r.deleted_at Is NULL");
                $res = $res->orderBy("r.id","desc");
                $reviews = $res->get()->getResultArray();
---
SELECT `r`.*, `c`.`name`
FROM `reviews` `r`
JOIN `customers` `c` ON `c`.`id`=`r`.`given_by`
WHERE `company_id` = '1'
AND `is_approved` = 1
AND `r`.`deleted_at` Is NULL
ORDER BY `r`.`id` DESC