app/Controllers/Api_form.php

SELECT `st`.`date`
FROM `staff_timings` `st`
WHERE `st`.`companyId` = '1'
AND `st`.`date` >= '2025-11-03'
GROUP BY `st`.`date`
---
        public function available_dates()
        {
            $post = $this->request->getVar();
            $input_parameter = array('key','tag','company_id');
            $validation = ParamValidation($input_parameter, $post);

            if($validation[RESPONSE_STATUS] == RESPONSE_FLAG_FAIL)
            {
                return $this->respond($validation);
            } else if($post['key'] != APP_KEY || $post['tag'] != "available_dates") {
                $response[RESPONSE_STATUS] = RESPONSE_FLAG_FAIL;
                $response[RESPONSE_MESSAGE] = RESPONSE_INVALID_KEY;
                return $this->respond($response);
            } else {
                $db = db_connect();
                $query = $db->table("staff_timings st");
                $query = $query->select("st.date");
                $query = $query->where("st.companyId", $post["company_id"]);
                $query = $query->where("st.date >=", date('Y-m-d'));
                $query = $query->groupBy("st.date");
                $result = $query->get()->getResultArray();