app/Controllers/CronController.php

        public function salon_whatsapp($company_id)
        {
            $model = db_connect();
            $today = date("Y-m-d");

            $result = $model->table("appointments a");
            $result = $result->join("customers c","c.id=a.customerId");
            $result = $result->select("a.id as appointment_id,c.name,c.phone");
            $result = $result->where(["a.companyId" => $company_id,"a.status" => 1,"DATE(a.bookingDate)" => $today]);
            $result = $result->whereIn("bookedFrom",[1,3]);
            $appointments = $result->get()->getResultArray();
            if($appointments) {
                foreach($appointments as $appointment) {
                    $items = $model->table("carts c");
                    $items = $items->select("c.id,c.appointmentId,c.stime,c.etime,c.serviceNm,c.amount,c.duration,c.amount");
                    $items = $items->where(["c.appointmentId" => $appointment["appointment_id"]]);
                    $services = $items->get()->getResultArray();
---
SELECT `a`.`id` as `appointment_id`, `c`.`name`, `c`.`phone`
FROM `appointments` `a`
JOIN `customers` `c` ON `c`.`id`=`a`.`customerId`
WHERE `a`.`companyId` = 1
AND `a`.`status` = 1
AND DATE(a.bookingDate) = '2025-11-03'
AND `bookedFrom` IN (1,3)
SELECT `c`.`id`, `c`.`appointmentId`, `c`.`stime`, `c`.`etime`, `c`.`serviceNm`, `c`.`amount`, `c`.`duration`, `c`.`amount`
FROM `carts` `c`
WHERE `c`.`appointmentId` = '81547'

        function callReminderWhatsapp($to, $body, $companyId)
        {
            $model = new CompanyModel();
            $company = $model->select("wa_phone_id,wa_token")->where("id",$companyId)->first();
---
SELECT `wa_phone_id`, `wa_token`
FROM `companies`
WHERE `id` = 1
 LIMIT 1