app/Controllers/Dashboard.php

        public function get_available_staff_time()
        {
            $date = $this->request->getVar('date');
            $date = date("Y-m-d",strtotime($date));
            $response = [];

            $db = db_connect();
            $staff = $db->table('staffs s');
            $staff->select("DISTINCT(s.id),CONCAT_WS(' ',s.fname,s.lname) AS title,s.color,st.stime,st.etime");
            $staff->join("staff_timings st","s.id=st.staffId");
            $staff->where('st.date',$date);
            $staff->where(['s.user_type' => 1,"s.is_active" => 1,"s.is_deleted" => 0]);
            $staff->where('st.companyId',static_company_id());
            $staffs = $staff->get()->getResultArray();
---
SELECT DISTINCT(s.id), CONCAT_WS(' ', `s`.`fname`, s.lname) AS title, `s`.`color`, `st`.`stime`, `st`.`etime`
FROM `staffs` `s`
JOIN `staff_timings` `st` ON `s`.`id`=`st`.`staffId`
WHERE `st`.`date` = '2025-11-04'
AND `s`.`user_type` = 1
AND `s`.`is_active` = 1
AND `s`.`is_deleted` = 0
AND `st`.`companyId` = '3'