app/Controllers/Service_groups.php

SELECT *
FROM `service_groups`
WHERE `id` = '37'
AND `is_deleted` = 0
---
        public function show($id)
        {
            if(isset($this->userdata["id"])) {
                if(check_permission("groups")) {
                    $model = New Service_group;
                    $data["service_group"] = $model->where("id",$id)->where("is_deleted",0)->get()->getRowArray();